web_services/wsdl_soap_with_requests/ch/templates/soaprequests/StockQuoteSericeRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://www.webserviceX.NET/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:GetQuote>
         <!--Optional:-->
         <web:symbol>{{ Data }}</web:symbol>
      </web:GetQuote>
   </soapenv:Body>
</soapenv:Envelope>